app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT * FROM "players"

  def show
    @player = Player.find(params[:id])
---
SELECT * FROM "players" WHERE ("players"."id" = 1)

  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("name", "updated_at", "RBI", "SB", "team", "AVG", "OPS", "RUNS", "HR", "created_at") VALUES('asd', '2010-06-22 17:52:33', 786, 765, 'fd', 0.3, 0.1, 23, 3456, '2010-06-22 17:52:33')

  def destroy
    @player = Player.find(params[:id])
    @player.destroy
---
SELECT * FROM "players" WHERE ("players"."id" = 1)
DELETE FROM "players" WHERE "id" = 1

  def clear_list
	Player.delete_all
---
DELETE FROM "players" WHERE 1=1

		player_ops = obp + sp


		Player.create(:name => player_name, :team => player_team, :AVG => player_avg, :HR => 					player_hr, :RBI => player_rbi, :RUNS => player_runs, :SB => player_sb,
				 :OPS => player_ops)
---
INSERT INTO "players" ("name", "updated_at", "RBI", "SB", "team", "AVG", "OPS", "RUNS", "HR", "created_at") VALUES('Jeff Abbott', '2010-06-24 20:54:00', 41, 3, 'White Sox', 0.278688524590164, 0.900908628796543, 33, 12, '2010-06-24 20:54:00')